var dealerinfo = new Array();
$(function() {
    var provinceinfo = ['安徽省', '北京市', '福建省', '甘肃省', '广东省', '广西壮族自治区', '贵州省', '海南省', '河北省', '河南省', '黑龙江省', '湖北省', '湖南省', '吉林省', '江苏省', '江西省', '辽宁省', '内蒙古自治区', '宁夏回族自治区', '青海省', '山东省', '山西省', '陕西省', '上海市', '四川省', '天津市', '新疆维吾尔自治区', '云南省', '浙江省', '重庆市'];
    var _html = '';
    $.each(provinceinfo, function(i, value) {
        _html += '<option value="' + value + '">' + value + '</option>';
    });
    $('#province').append(_html);
    $('#province').change(function() {
        city();
    });
    var _dealerArray = [];
    $('#citys').change(function() {
        var _ht = '';
        var getCityVal = $('#citys option:selected').val();
        $.each(dealerinfo, function(i, value) {
            if (value[6] === getCityVal) {
                var _dealerVal = value[9];
                _ht += '<option value="' + _dealerVal + '">' + _dealerVal + '</option>';
            }

        });
        $('#dealer').html(_ht);
    });
});

function city() {
    var getVal = $('#province option:selected').val();
    var city = $('#citys');
    if (false) {} else if (getVal == '安徽省') {
        city.html('<option value="-1">请选择城市</option><option value="滁州市">滁州市</option><option value="阜阳市">阜阳市</option><option value="合肥市">合肥市</option><option value="六安市">六安市</option><option value="芜湖市">芜湖市</option>');
    } else if (getVal == '北京市') {
        city.html('<option value="-1">请选择城市</option><option value="北京市">北京市</option>');
    } else if (getVal == '福建省') {
        city.html('<option value="-1">请选择城市</option><option value="福州市">福州市</option><option value="晋江市">晋江市</option><option value="龙岩市">龙岩市</option><option value="泉州市">泉州市</option><option value="厦门市">厦门市</option>');
    } else if (getVal == '甘肃省') {
        city.html('<option value="-1">请选择城市</option><option value="嘉峪关市">嘉峪关市</option><option value="兰州市">兰州市</option>');
    } else if (getVal == '广东省') {
        city.html('<option value="-1">请选择城市</option><option value="东莞市">东莞市</option><option value="佛山市">佛山市</option><option value="广州市">广州市</option><option value="惠州市">惠州市</option><option value="江门市">江门市</option><option value="汕头市">汕头市</option><option value="深圳市">深圳市</option><option value="湛江市">湛江市</option>');
    } else if (getVal == '广西壮族自治区') {
        city.html('<option value="-1">请选择城市</option><option value="桂林市">桂林市</option><option value="柳州市">柳州市</option><option value="南宁市">南宁市</option>');
    } else if (getVal == '贵州省') {
        city.html('<option value="-1">请选择城市</option><option value="贵阳市">贵阳市</option><option value="六盘水市">六盘水市</option><option value="遵义市">遵义市</option>');
    } else if (getVal == '海南省') {
        city.html('<option value="-1">请选择城市</option><option value="海口市">海口市</option>');
    } else if (getVal == '河北省') {
        city.html('<option value="-1">请选择城市</option><option value="保定市">保定市</option><option value="邯郸市">邯郸市</option><option value="石家庄市">石家庄市</option><option value="唐山市">唐山市</option>');
    } else if (getVal == '河南省') {
        city.html('<option value="-1">请选择城市</option><option value="安阳市">安阳市</option><option value="焦作市">焦作市</option><option value="洛阳市">洛阳市</option><option value="南阳市">南阳市</option><option value="商丘市">商丘市</option><option value="新乡市">新乡市</option><option value="信阳市">信阳市</option><option value="许昌市">许昌市</option><option value="郑州市">郑州市</option>');
    } else if (getVal == '黑龙江省') {
        city.html('<option value="-1">请选择城市</option><option value="哈尔滨市">哈尔滨市</option>');
    } else if (getVal == '湖北省') {
        city.html('<option value="-1">请选择城市</option><option value="黄石市">黄石市</option><option value="荆州市">荆州市</option><option value="武汉市">武汉市</option><option value="襄阳市">襄阳市</option><option value="宜昌市">宜昌市</option>');
    } else if (getVal == '湖南省') {
        city.html('<option value="-1">请选择城市</option><option value="长沙市">长沙市</option><option value="常德市">常德市</option><option value="郴州市">郴州市</option><option value="衡阳市">衡阳市</option><option value="怀化市">怀化市</option><option value="株洲市">株洲市</option>');
    } else if (getVal == '吉林省') {
        city.html('<option value="-1">请选择城市</option><option value="长春市">长春市</option><option value="吉林市">吉林市</option>');
    } else if (getVal == '江苏省') {
        city.html('<option value="-1">请选择城市</option><option value=" 太仓市"> 太仓市</option><option value="常州市">常州市</option><option value="淮安市">淮安市</option><option value="昆山市">昆山市</option><option value="连云港市">连云港市</option><option value="南京市">南京市</option><option value="南通市">南通市</option><option value="苏州市">苏州市</option><option value="宿迁市">宿迁市</option><option value="泰州市">泰州市</option><option value="无锡市">无锡市</option><option value="徐州市">徐州市</option><option value="盐城市">盐城市</option><option value="扬州市">扬州市</option><option value="宜兴市">宜兴市</option><option value="镇江市">镇江市</option>');
    } else if (getVal == '江西省') {
        city.html('<option value="-1">请选择城市</option><option value="赣州市">赣州市</option><option value="南昌市">南昌市</option><option value="上饶市">上饶市</option>');
    } else if (getVal == '辽宁省') {
        city.html('<option value="-1">请选择城市</option><option value="大连市">大连市</option><option value="沈阳市">沈阳市</option>');
    } else if (getVal == '内蒙古自治区') {
        city.html('<option value="-1">请选择城市</option><option value="鄂尔多斯市">鄂尔多斯市</option><option value="呼和浩特市">呼和浩特市</option><option value="通辽市">通辽市</option>');
    } else if (getVal == '宁夏回族自治区') {
        city.html('<option value="-1">请选择城市</option><option value="银川市">银川市</option>');
    } else if (getVal == '青海省') {
        city.html('<option value="-1">请选择城市</option><option value="西宁市">西宁市</option>');
    } else if (getVal == '山东省') {
        city.html('<option value="-1">请选择城市</option><option value="滨州市">滨州市</option><option value="德州市">德州市</option><option value="东营市">东营市</option><option value="菏泽市">菏泽市</option><option value="济南市">济南市</option><option value="济宁市">济宁市</option><option value="莱芜市">莱芜市</option><option value="聊城市">聊城市</option><option value="临沂市">临沂市</option><option value="青岛市">青岛市</option><option value="泰安市">泰安市</option><option value="威海市">威海市</option><option value="潍坊市">潍坊市</option><option value="烟台市">烟台市</option><option value="枣庄市">枣庄市</option><option value="淄博市">淄博市</option>');
    } else if (getVal == '山西省') {
        city.html('<option value="-1">请选择城市</option><option value="太原市">太原市</option><option value="运城市">运城市</option>');
    } else if (getVal == '陕西省') {
        city.html('<option value="-1">请选择城市</option><option value="西安市">西安市</option><option value="榆林市">榆林市</option>');
    } else if (getVal == '上海市') {
        city.html('<option value="-1">请选择城市</option><option value="上海市">上海市</option>');
    } else if (getVal == '四川省') {
        city.html('<option value="-1">请选择城市</option><option value="成都市">成都市</option><option value="达州市">达州市</option><option value="德阳市">德阳市</option><option value="乐山市">乐山市</option><option value="凉山彝族自治州">凉山彝族自治州</option><option value="泸州市">泸州市</option><option value="绵阳市">绵阳市</option><option value="南充市">南充市</option><option value="宜宾市">宜宾市</option>');
    } else if (getVal == '天津市') {
        city.html('<option value="-1">请选择城市</option><option value="天津市">天津市</option>');
    } else if (getVal == '新疆维吾尔自治区') {
        city.html('<option value="-1">请选择城市</option><option value="阿克苏地区">阿克苏地区</option><option value="乌鲁木齐市">乌鲁木齐市</option>');
    } else if (getVal == '云南省') {
        city.html('<option value="-1">请选择城市</option><option value="大理市">大理市</option><option value="昆明市">昆明市</option>');
    } else if (getVal == '浙江省') {
        city.html('<option value="-1">请选择城市</option><option value="杭州市">杭州市</option><option value="湖州市">湖州市</option><option value="嘉兴市">嘉兴市</option><option value="金华市">金华市</option><option value="宁波市">宁波市</option><option value="衢州市">衢州市</option><option value="绍兴市">绍兴市</option><option value="台州市">台州市</option><option value="温州市">温州市</option><option value="义乌市">义乌市</option>');
    } else if (getVal == '重庆市') {
        city.html('<option value="-1">请选择城市</option><option value="重庆市">重庆市</option>');
    }
}


dealerinfo[0] = new Array('CD1020', '上海安吉名世', '上海市普陀区铜川路1288号', '31.2528', '121.391', '上海市', '上海市', '021-52816688', '200333', '上海安吉名世汽车服务有限公司', 1, 1, 'http://shajms.ecaddy.com.cn/', '/upload/dealer/qcode/20150515125257968_上海安吉名世.jpg');
dealerinfo[1] = new Array('CD1010', '上海永达申龙', '上海市龙东大道2711号', '31.2264', '121.624', '上海市', '上海市', '021-58786789', '201203', '上海永达申龙汽车销售服务有限公司', 1, 1, 'http://shydsl.ecaddy.com.cn/', '/upload/dealer/qcode/20150515125650784_上海永达申龙.jpg');
dealerinfo[2] = new Array('CD1021', '上海绿地徐畅', '上海市沪松公路1197号（嘉闵高架漕宝路方向沪松公路出口)', '31.1464', '121.324', '上海市', '上海市', '021-57635222', '201615', '上海绿地徐畅汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[3] = new Array('CD1000', '上海东昌', '上海浦东新区御桥路1470号', '31.1581', '121.557', '上海市', '上海市', '021-68933888', '201204', '上海东昌凯帝汽车销售服务有限公司', 1, 1, 'http://shdckd.ecaddy.com.cn/', '/upload/dealer/qcode/20150515125620468_上海东昌凯帝.jpg');
dealerinfo[4] = new Array('CD1023', '上海百联', '上海市闸北区共和新路3200号', '31.2962', '121.448847', '上海市', '上海市', '021-51022188', '200435', '上海百联沪通汽车销售有限公司', 1, 1, 'http://shblht.ecaddy.com.cn/', '/upload/dealer/qcode/20150515125544828_上海百联沪通.jpg');
dealerinfo[5] = new Array('CD1580', '浙江米卡迪', '杭州市杭行路217号', '30.3288', '120.126', '浙江省', '杭州市', '0571-88175888', '310015', '浙江米卡迪汽车销售服务有限公司', 1, 1, 'http://zjmkd.ecaddy.com.cn/', '/upload/dealer/qcode/20150515130132182_浙江米卡迪.jpg');
dealerinfo[6] = new Array('CD1581', '浙江康源', '浙江省杭州市绍兴路422号', '30.3044', '120.16', '浙江省', '杭州市', '0571-88301666', '310004', '浙江康源汽车销售服务有限公司', 1, 1, 'http://zjky.ecaddy.com.cn/', '/upload/dealer/qcode/20150515130111111_浙江康源.jpg');
dealerinfo[7] = new Array('CD1585', '宁波轿辰凯盛', '浙江省宁波市江北区庄桥街道马径汽车园（机动车第一检测站对面）', '29.9392340000', '121.5825250000', '浙江省', '宁波市', '0574-87647222', '315032', '宁波轿辰凯盛汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[8] = new Array('CD1510', '宁波凯迪', '宁波市海曙区启运路70号', '29.845644', '121.523061', '浙江省', '宁波市', '0574-56280888', '315012', '宁波凯迪汽车销售服务有限公司', 1, 1, 'http://nbkd.ecaddy.com.cn/', '/upload/dealer/qcode/20150515125838810_宁波凯迪.jpg');
dealerinfo[9] = new Array('CD1520', '温州凯特', '温州市龙湾区状元镇机场大道2168号', '27.983668', '120.755511', '浙江省', '温州市', '0577-86577888', '325011', '温州凯特汽车销售服务有限公司', 1, 1, 'http://wzkt.ecaddy.com.cn/', '/upload/dealer/qcode/20150515125959458_温州凯特.jpg');
dealerinfo[10] = new Array('CD1565', '义乌凯克', '浙江省义乌市稠州西路408号（稠州西路与西城路交叉口）', '29.307542', '120.055321', '浙江省', '义乌市', '0579-85400688', '322000', '义乌凯克汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[11] = new Array('CD1570', '绍兴宏盛', '绍兴市袍江开发区康宁路市车管所对面', '30.0981', '120.608', '浙江省', '绍兴市', '0575-85086888', '312000', '绍兴宏盛凯迪汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[12] = new Array('CD1582', '金华凯迪', '金华市环城北路道院塘交警支队西侧', '29.1129', '119.648', '浙江省', '金华市', '0579-82918800', '321000', '金华凯迪汽车销售有限公司', 1, 1, '', '');
dealerinfo[13] = new Array('CD1584', '浙江康润', '嘉兴市昌盛南路与嘉杭路交叉口（汽车精品街区内）', '30.46', '120.45', '浙江省', '嘉兴市', '0573-82296999', '314000', '浙江康润汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[14] = new Array('CD1583', '湖州润东', '湖州吴兴区蜀山路2999号（湖织大道G50高速出口旁）', '30.8888', '120.15', '浙江省', '湖州市', '0572-2113333', '313000', '湖州润东汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[15] = new Array('CD1660', '厦门泰成致尊', '福建省厦门市湖里区湖里大道13号（厦华电子正对面）', '24.5178280000', '118.1048480000', '福建省', '厦门市', '0592-2632855', '361006', '厦门泰成致尊汽车服务有限公司', 1, 1, 'http://xmtczz.ecaddy.com.cn/', '/upload/dealer/qcode/20150515125910929_厦门泰成致尊.jpg');
dealerinfo[16] = new Array('CD1670', '泉州泰成致尊', '福建省泉州经济技术开发区迎宾大道泉州南高速路口', '24.8767860000', '118.5489740000', '福建省', '泉州市', '0595-28057888', '362000', '泉州泰成致尊汽车服务有限公司', 1, 1, '', '');
dealerinfo[17] = new Array('CD1311', '江苏华海凯迪', '南京市江宁区上坊东麒路汽车4S园凯迪拉克旗舰店', '31.9844', '118.873', '江苏省', '南京市', '025-52795688', '211103', '江苏华海凯迪汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[18] = new Array('CD1310', '江苏天泓凯帝', '南京市卡子门大街29号（红星美凯龙卡子门店一层东侧）', '31.995144', '118.805456', '江苏省', '南京市', '025-52629922', '210012', '江苏天泓凯帝汽车服务有限公司', 1, 1, 'http://jsthkd.ecaddy.com.cn/', '/upload/dealer/qcode/20150515130403727_江苏天泓凯帝.jpg');
dealerinfo[19] = new Array('CD1300', '苏州华洋', '苏州市吴中区木渎镇中山东路189号', '31.262958', '120.554678', '江苏省', '苏州市', '0512-66516268', '215000', '苏州华洋汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[20] = new Array('CD1308', '苏州华楷', '苏州市吴中区兴郭路尹山华成集团一楼', '31.2776610000', '120.6593990000', '江苏省', '苏州市', '0512-65966668', '215000', '苏州华楷汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[21] = new Array('CD1307', '苏州东昌', '苏州市相城区元和街道太阳路2200号', '31.417761', '120.641967', '江苏省', '苏州市', '0512-65809999', '215000', '苏州东昌凯帝汽车销售服务有限公司', 1, 1, 'http://szdckd.ecaddy.com.cn/', '/upload/dealer/qcode/20150515130950261_苏州东昌凯帝.jpg');
dealerinfo[22] = new Array('CD1352', '泰州万帮', '泰州大道国际汽车城内', '32.4253', '119.9', '江苏省', '泰州市', '0523-89999009', '225300', '泰州万帮凯帝汽车销售服务有限公司', 1, 1, 'http://tzwbkd.ecaddy.com.cn/', '/upload/dealer/qcode/20151014141815090_泰州万帮凯帝.jpg');
dealerinfo[23] = new Array('CD1320', '无锡申通', '无锡市北塘区广石路999号', '31.6178', '120.287', '江苏省', '无锡市', '0510-83111333', '214000', '无锡申通汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[24] = new Array('CD1312', '无锡润通', '江苏省无锡市锡山区先锋中路25-9号', '31.588662', '120.430681', '江苏省', '无锡市', '0510-88227000', '214104', '无锡润通汽车销售服务有限公司', 1, 1, 'http://wxrt.ecaddy.com.cn/', '/upload/dealer/qcode/20151030150142218_无锡润通汽车销售服务有限公司.jpg');
dealerinfo[25] = new Array('CD1351', '扬州名凯', '江苏省扬州市维扬区扬子江北路国际汽车城2号', '32.4499', '119.381', '江苏省', '扬州市', '0514-80788888', '225008', '扬州名凯汽车销售服务有限公司', 1, 1, 'http://yzmk.ecaddy.com.cn/', '/upload/dealer/qcode/20151014141745474_扬州名凯.jpg');
dealerinfo[26] = new Array('CD1350', '常州凯尊', '江苏省常州市武进区湖塘镇武进汽车城C区10号', '31.698189', '119.971208', '江苏省', '常州市', '0519-88888698', '213000', '常州凯尊汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[27] = new Array('CD1335', '徐州万帮凯帝', '徐州经济开发区城东大道北侧、经七路东侧', '34.15', '117.11', '江苏省', '徐州市', '0516-83361111', '221000', '徐州万帮凯帝汽车销售服务有限公司', 1, 1, 'http://xzwbkd.ecaddy.com.cn/', '/upload/dealer/qcode/20150515131150201_徐州万帮凯蒂.jpg');
dealerinfo[28] = new Array('CD1353', '江苏天泓凯萨', '江苏省盐城市盐都区新华路6号（永宁汽车城东侧）', '33.333358', '120.141174', '江苏省', '盐城市', '0515-81990000', '224000', '江苏天泓凯萨汽车服务有限公司', 1, 1, 'http://jsthks.ecaddy.com.cn/', '/upload/dealer/qcode/20150602123110191_江苏天泓凯萨.png');
dealerinfo[29] = new Array('CD1301', '镇江东方辰通', '镇江新区丁卯楚桥路75号', '32.1826910000', '119.5283390000', '江苏省', '镇江市', '0511-87053333', '212009', '镇江东方辰通汽车销售服务有限公司', 1, 1, 'http://zjdfct.ecaddy.com.cn/', '/upload/dealer/qcode/20150814112252420_镇江东方辰通.jpg');
dealerinfo[30] = new Array('CD1795', '安徽世贸', '合肥市当涂路与双七路交叉口', '31.8877', '117.341', '安徽省', '合肥市', '0551-64399188', '230011', '安徽世贸汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[31] = new Array('CD1796', '安徽恒信星凯', '安徽省合肥市蒙城北路1111号（蒙城北路与电厂路交叉路口）', '31.962727', '117.263502', '安徽省', '合肥市', '0551-65981777', '230001', '安徽恒信星凯汽车销售服务有限公司', 1, 1, 'http://ahhxxk.ecaddy.com.cn/', '/upload/dealer/qcode/20150515130320633_安徽恒信星凯.jpg');
dealerinfo[32] = new Array('CD1797', '芜湖亚德', '安徽省芜湖市鸠江区万春西路汽车城内（鸠江区法院对面）', '31.365217', '118.40189', '安徽省', '芜湖市', '0553-5856677', '241000', '芜湖亚德汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[33] = new Array('CD1400', '山东坤驰', '济南市高新开发区世纪大道1号', '36.6894', '117.137', '山东省', '济南市', '0531-88828686', '250101', '山东凯迪坤驰汽车销售服务有限公司', 1, 1, 'http://sdkc.ecaddy.com.cn/', '/upload/dealer/qcode/20150515130849259_山东坤驰.jpg');
dealerinfo[34] = new Array('CD1401', '济南豪仕', '山东省济南市槐荫区经十西路2518号', '36.638517', '116.842475', '山东省', '济南市', '0531-66561666', '250117', '济南豪仕汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[35] = new Array('CD1410', '青岛鸿发凯迪', '青岛市银川西路21号', '36.0856', '120.406', '山东省', '青岛市', '0532-89095777', '266071', '青岛鸿发凯迪汽车销售服务有限公司', 1, 1, 'http://qdhfkd.ecaddy.com.cn/', '/upload/dealer/qcode/20150515130732135_青岛鸿发凯迪.jpg');
dealerinfo[36] = new Array('CD1402', '青岛鸿发森岳', '山东省青岛市城阳区流亭街道赵哥庄社区赵红路2号', '36.259778', '120.425606', '山东省', '青岛市', '0532-55718777', '266108', '青岛鸿发凯迪汽车销售服务有限公司', 1, 1, 'http://qdhfsy.ecaddy.com.cn/', '/upload/dealer/qcode/20150515130758309_青岛鸿发森岳.jpg');
dealerinfo[37] = new Array('CD1412', '潍坊鸿发', '山东省潍坊市寒亭区通亭街与霞飞路交叉口东北角', '36.7531', '119.165', '山东省', '潍坊市', '0536-8512777', '261100', '潍坊鸿发凯迪汽车销售服务有限公司', 1, 1, 'http://wfhf.ecaddy.com.cn/', '/upload/dealer/qcode/20150515131056014_潍坊鸿发.jpg');
dealerinfo[38] = new Array('CD1411', '临沂申华', '临沂市罗庄区沂河路与琅琊王路交汇处', '35.0164', '118.296', '山东省', '临沂市', '0539-8504888', '276000', '临沂申华汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[39] = new Array('CD1413', '淄博凯迪坤驰', '淄博市周村区齐鲁CX汽车文化广场凯迪拉克', '36.7864', '117.913', '山东省', '淄博市', '0533-7980888', '255000', '淄博凯迪坤驰汽车销售服务有限公司', 1, 1, 'http://zbkdkc.ecaddy.com.cn/', '/upload/dealer/qcode/20150602123247760_淄博凯迪坤驰.png');
dealerinfo[40] = new Array('CD1415', '东营凯通', '山东省东营市西四路五干桥南800米路东', '37.444063', '118.48712', '山东省', '东营市', '0546-7078888', '257000', '东营凯通汽车销售服务有限公司', 1, 1, 'http://dykt.ecaddy.com.cn/', '/upload/dealer/qcode/20150602123214662_东营凯通.png');
dealerinfo[41] = new Array('CD1210', '广东粤凯', '广州市番禺区番禺大道北331号（原迎宾路1860号）', '23.0011', '113.347', '广东省', '广州市', '020-34822222', '511442', '广东粤凯汽车销售服务有限公司', 1, 1, 'http://gdyk.ecaddy.com.cn/', '/upload/dealer/qcode/20150515131319876_广东粤凯.jpg');
dealerinfo[42] = new Array('CD1205', '广州广物盈凯', '广州市白云区机场路888号广东汽车市场四号楼首层', '23.1883', '113.257', '广东省', '广州市', '020-86329088', '510410', '广州广物盈凯汽车销售有限公司', 1, 1, 'http://gzgwykqc.ecaddy.com.cn/', 'http://mini.cadillac.com.cn/upload/dealer/qcode/20160603154512956_广州广物盈凯汽车销售有限公司.jpg');
dealerinfo[43] = new Array('CD1206', '广州广物胜凯', '广州市天河区黄埔大道东鱼珠路段33号国际木材市场11号门对面', '23.1043870000', '113.4359450000', '广东省', '广州市', '020-82490888', '510000', '广东广物胜凯汽车销售服务有限公司', 1, 1, 'http://gwsk.ecaddy.com.cn/', 'http://mini.cadillac.com.cn/upload/dealer/qcode/20160603154457604_广东广物胜凯汽车销售服务有限公司.jpg');
dealerinfo[44] = new Array('CD1290', '深圳红彤', '深圳市罗湖区博隆大厦首层红彤汽车品鉴中心', '22.5849290000', '114.1175750000', '广东省', '深圳市', '0755-25920555', '518023', '深圳市红彤汽车股份有限公司', 1, 1, 'http://szshtkd.ecaddy.com.cn/', '/upload/dealer/qcode/20151014142023000_深圳市红彤凯迪.jpg');
dealerinfo[45] = new Array('CD1221', '深圳标远', '深圳市福田区滨河路9333号', '22.533166', '114.026329', '广东省', '深圳市', '0755-82028111', '518040', '深圳市标远鹏程汽车有限公司', 1, 1, 'http://szbypc.ecaddy.com.cn/', '/upload/dealer/qcode/20150515132138192_深圳市标远鹏程.jpg');
dealerinfo[46] = new Array('CD1222', '深圳骅克', '广东省深圳市宝安区大铲湾港区金湾大道二段168-2号', '22.567155', '113.858953', '广东省', '深圳市', '0755-33001111', '518000', '深圳市骅克汽车销售服务有限公司', 1, 1, 'http://szhk.ecaddy.com.cn/', '/upload/dealer/qcode/20150515132222260_深圳市骅克.jpg');
dealerinfo[47] = new Array('CD1270', '东莞志诚', '广东省东莞市寮步镇国际汽车城内', '23.0194190000', '113.8564710000', '广东省', '东莞市', '0769-83306678', '523413', '东莞市志诚汽车服务有限公司', 1, 1, '', '');
dealerinfo[48] = new Array('CD1292', '汕头众成', '汕头市龙湖区泰山北路156号', '23.4291', '116.713', '广东省', '汕头市', '0754-89832666', '515041', '汕头市众成汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[49] = new Array('CD1825', '广西桂海', '广西南宁市秀厢大道199号金源国际汽车城内', '22.8669', '108.354', '广西壮族自治区', '南宁市', '0771-3322662', '530023', '广西桂海汽车销售服务有限责任公司', 1, 1, '', '');
dealerinfo[50] = new Array('CD1841', '江西运通', '江西省青云谱区三店西路319号', '29.710136', '115.901', '江西省', '南昌市', '0797-88560011', '330001', '江西运通凯威汽车销售服务有限公司', 1, 1, 'http://jxytkw.ecaddy.com.cn/', '/upload/dealer/qcode/20150515132110984_江西运通凯威.jpg');
dealerinfo[51] = new Array('CD1840', '江西绿地', '南昌红谷滩丰和南大道学府路口', '28.66769613', '115.8410454', '江西省', '南昌市', '0791-83860888', '330100', '江西绿地名凯汽车销售服务有限公司', 1, 1, 'http://jxldmk.ecaddy.com.cn/', '/upload/dealer/qcode/20150814112423338_江西绿地名凯汽车销售服务有限公司.jpg');
dealerinfo[52] = new Array('CD1705', '湖南申湘', '湖南省长沙市星沙经济技术开发区(申湘汽车商务广场)凯迪拉克品鉴中心', '28.2312', '113.059', '湖南省', '长沙市', '0731-84872222', '411400', '湖南申湘汽车天衡销售服务有限公司', 1, 1, 'http://htsxth.ecaddy.com.cn/', '/upload/dealer/qcode/20150515132013146_湖南申湘天衡.jpg');
dealerinfo[53] = new Array('CD1706', '长沙星凯', '湖南省长沙市雨花区万家丽南路二段19号（环保科技园）', '28.089802', '113.042816', '湖南省', '长沙市', '0731-88519999', '410000', '长沙恒信星凯汽车销售服务有限公司', 1, 1, 'http://cchxxk.ecaddy.com.cn/', '/upload/dealer/qcode/20150515132329972_长沙恒信星凯.jpg');
dealerinfo[54] = new Array('CD1675', '四川新东信', '四川省成都市羊西线蜀西路165号', '30.7142', '103.985', '四川省', '成都市', '028-68119999', '610036', '四川新东信汽车服务有限公司', 1, 1, 'http://scxdx.ecaddy.com.cn/', '/upload/dealer/qcode/20150515132648441_四川新东信.jpg');
dealerinfo[55] = new Array('CD1676', '成都美威行', '成都市火车南站西路1618号', '30.5956', '104.03', '四川省', '成都市', '028-66229999', '610041', '成都美威行汽车服务有限公司', 1, 1, 'http://cdmwh.ecaddy.com.cn/', '/upload/dealer/qcode/20150515132421344_成都美威行.jpg');
dealerinfo[56] = new Array('CD1677', '港宏凯威行', '四川省成都市锦江区南三环路二段外侧（石胜路口）', '30.6004150000', '104.1217100000', '四川省', '成都市', '028-6256 1666', '610023', '四川港宏浩升汽车销售服务有限公司', 1, 1, 'http://scghkwh.ecaddy.com.cn/', '/upload/dealer/qcode/20150515132622016_四川港宏凯威行.jpg');
dealerinfo[57] = new Array('CD1679', '绵阳美威行', '四川省绵阳市经开区绵州大道中段6号', '28.747575', '104.600311', '四川省', '绵阳市', '0816-6858888', '621000', '绵阳美威行汽车服务有限公司', 1, 1, '', '');
dealerinfo[58] = new Array('CD1600', '重庆美凯', '重庆市经开区金渝大道99号附11号', '29.644176', '106.58003', '重庆市', '重庆市', '023-89112628', '401122', '重庆中汽西南美凯汽车有限公司', 1, 1, '', '');
dealerinfo[59] = new Array('CD1655', '河南新凯迪', '河南省郑州市航海东路与第一大街交汇处西100米', '34.7368450000', '113.7459190000', '河南省', '郑州市', '0371-69398888', '450048', '河南新凯迪汽车销售服务有限公司', 1, 1, 'http://hnxkd.ecaddy.com.cn/', '/upload/dealer/qcode/20150515132501011_河南新凯迪.jpg');
dealerinfo[60] = new Array('CD1656', '河南威佳金凯', '郑州市花园路与开元路交叉口省汽车贸易中心院内', '34.8704560000', '113.6800450000', '河南省', '郑州市', '0371-55907777', '450000', '河南威佳金凯汽车销售服务有限公司', 1, 1, 'http://hnwjjk.ecaddy.com.cn/', '/upload/dealer/qcode/20150515132444747_河南威佳金凯.jpg');
dealerinfo[61] = new Array('CD1657', '南阳新凯迪', '河南省南阳市人民北路与信臣路（原312国道）交汇处向西300米路南', '33.035', '112.526', '河南省', '南阳市', '0377--62208888', '473000', '南阳市新凯迪汽车贸易有限公司', 1, 1, 'http://nyxkd.ecaddy.com.cn/', '/upload/dealer/qcode/20160226111205759_南阳市新凯迪汽车贸易有限公司.jpg');
dealerinfo[62] = new Array('CD1658', '新乡卡迪', '河南省新乡市南环路与和平大道交叉口向西1.5公里', '35.262441', '113.883076', '河南省', '新乡市', '0373-2656555', '453000', '新乡市卡迪汽车贸易有限公司', 1, 1, '', '');
dealerinfo[63] = new Array('CD1780', '陕西凯盛', '陕西省西安市经济技术开发区明光路61号（凤城六路与明光路十字东南角）', '34.33912', '108.9369', '陕西省', '西安市', '029-86526111', '710021', '陕西凯盛汽车销售服务有限公司', 1, 1, 'http://sxks.ecaddy.com.cn/', '/upload/dealer/qcode/20151231142757417_陕西凯盛汽车销售服务有限公司.jpg');
dealerinfo[64] = new Array('CD1781', '陕西华兴乾程', '陕西省西安市浐灞生态区汽车主题公园融三路', '34.32511', '109.053028', '陕西省', '西安市', '029-83335000', '710024', '陕西华兴乾程汽车销售有限公司', 1, 1, '', '');
dealerinfo[65] = new Array('CD1915', '兰州金茂', '兰州市城关区均家滩371-1号（凯迪拉克4S店）', '36.328', '103.526', '甘肃省', '兰州市', '0931-2198000', '730000', '兰州金茂汽车有限公司', 1, 1, 'http://lzjm.ecaddy.com.cn/', '/upload/dealer/qcode/20150814112504553_兰州金茂.jpg');
dealerinfo[66] = new Array('CD1870', '新疆骏达', '乌鲁木齐市米东区振兴南路201号', '43.9509920000', '87.6340910000', '新疆维吾尔自治区', '乌鲁木齐市', '0991-3668999', '830019', '新疆骏达汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[67] = new Array('CD1810', '云南凯迪', '云南省昆明市黄土坡高新开发区小屯国际汽车城4号地', '25.0763', '102.664', '云南省', '昆明市', '0871-68338888', '650101', '云南凯迪汽车贸易有限公司', 1, 1, 'http://ynkd.ecaddy.com.cn/', '/upload/dealer/qcode/20150515132739075_云南凯迪.jpg');
dealerinfo[68] = new Array('CD1690', '武汉星凯', '湖北省武汉市汉阳区龙阳大道67号（邱家大湾）', '30.553964', '114.210389', '湖北省', '武汉市', '027-84887777', '430051', '武汉星凯汽车销售服务有限公司', 1, 1, 'http://whxk.ecaddy.com.cn/', '/upload/dealer/qcode/20150814112535595_武汉星凯.jpg');
dealerinfo[69] = new Array('CD1689', '武汉康顺', '湖北省武汉市盘龙城经济开发区盘龙汽车城', '30.7275', '114.236', '湖北省', '武汉市', '027-61889797', '430312', '武汉康顺凯迪汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[70] = new Array('CD1855', '贵州通远', '贵州省贵阳市沙冲南路259号', '26.5380870000', '106.7019230000', '贵州省', '贵阳市', '0851-88559000', '550004', '贵州通远汽车销售服务有限公司', 1, 1, 'http://gzty.ecaddy.com.cn/', '/upload/dealer/qcode/20150814112653167_贵州通远.jpg');
dealerinfo[71] = new Array('CD1700', '宁夏润德', '银川市金凤区工业集中区创业路', '38.4485', '106.147', '宁夏回族自治区', '银川市', '0951-2172333', '750004', '宁夏润德汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[72] = new Array('CD1630', '辽宁鑫卡迪', '沈阳市铁西区北二中路8号', '41.8066', '123.366', '辽宁省', '沈阳市', '024-25506688', '110025', '辽宁鑫卡迪汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[73] = new Array('CD1631', '大连驰敖', '大连市保税区中港北二路9号-2', '39.0421', '121.835', '辽宁省', '大连市', '0411-39251888', '116600', '大连驰敖凯迪汽车有限公司', 1, 1, 'http://dlcakd.ecaddy.com.cn/', '/upload/dealer/qcode/20150515133127691_大连驰敖凯迪.jpg');
dealerinfo[74] = new Array('CD1100', '北京达世行华威', '北京市朝阳区东三环华威桥东北角', '39.875052', '116.467712', '北京市', '北京市', '4007-702-701', '100012', '北京达世行华威汽车维修服务有限公司', 1, 1, 'http://bjdshhw.ecaddy.com.cn/', '/upload/dealer/qcode/20150515132839141_北京达世行华威.jpg');
dealerinfo[75] = new Array('CD1130', '北京达世行北苑', '北京市朝阳区来广营西路99号（北苑检测场对面）', '40.028357', '116.438765', '北京市', '北京市', '4007-702-701', '100021', '北京达世行北苑汽车销售服务有限公司', 1, 1, 'http://bjdshby.ecaddy.com.cn/', '/upload/dealer/qcode/20150515132923437_北京达世行北苑.jpg');
dealerinfo[76] = new Array('CD1101', '北京通孚祥', '北京市朝阳区石各庄路100号', '39.9402', '116.555', '北京市', '北京市', '010-65489999', '100024', '北京通孚祥汽车销售服务有限公司', 1, 1, 'http://bjtfx.ecaddy.com.cn/', '/upload/dealer/qcode/20150515133057860_北京通孚祥.jpg');
dealerinfo[77] = new Array('CD1155', '北京凯迪行', '北京市石景山区黄庄43号（莲石东路莲玉桥西300米）', '39.8962', '116.241', '北京市', '北京市', '010-6860-0008', '100040', '北京凯迪行汽车销售服务有限公司', 1, 1, 'http://bjkdh.ecaddy.com.cn/', '/upload/dealer/qcode/20150515133021680_北京凯迪行.jpg');
dealerinfo[78] = new Array('CD1615', '天津四联空港', '天津市东丽区津汉公路空港物流加工区汽车园中路3号', '39.165639', '117.373697', '天津市', '天津市', '022-84909886', '300300', '天津市四联空港汽车销售服务有限公司', 1, 1, 'http://tjslkg.ecaddy.com.cn/', '/upload/dealer/qcode/20150814112737077_天津市四联空港.jpg');
dealerinfo[79] = new Array('CD1740', '河北元兴行', '河北省石家庄市东开发区长江大道155号（长江大道与华山街交汇处北行200米路西）', '38.045825', '114.63142', '河北省', '石家庄市', '0311-85681000', '0 50081', '河北元兴行汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[80] = new Array('CD1747', '邯郸星凯', '河北省邯郸巿复兴区复兴路342号（复兴路汽车城内）', '36.60974', '114.46269', '河北省', '邯郸市', '0310-5601888', '056003', '邯郸星凯汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[81] = new Array('CD1746', '保定轩宇杰骜', '河北省保定市高开区创业路和向阳路交叉口（轩宇俊鹏汽车城内）', '38.905', '115.452', '河北省', '保定市', '0312-3917777', '0 71051', '保定轩宇杰骜汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[82] = new Array('CD1745', '唐山荣川凯爵', '唐山市西外环与新机场路立交桥北侧（荣川汽车园区内）', '39.6684', '118.101', '河北省', '唐山市', '0315-5518080', '0 64001', '唐山荣川凯爵汽车销售有限公司', 1, 1, 'http://tsrckj.ecaddy.com.cn/', '/upload/dealer/qcode/20150515133231979_唐山荣川凯爵.jpg');
dealerinfo[83] = new Array('CD1766', '长春宏明', '长春市经济开发区东南湖大路3452号', '43.8513', '125.401', '吉林省', '长春市', '0431-89107079', '130033', '长春宏明汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[84] = new Array('CD1900', '内蒙古泰祥', '呼和浩特市回民区海拉尔西街利丰汽车文化广场', '40.8175', '111.599', '内蒙古自治区', '呼和浩特市', '0471-3388066', '0 10051', '内蒙古泰祥汽车服务有限公司', 1, 1, '', '');
dealerinfo[85] = new Array('CD1901', '鄂尔多斯新丰泰凯盛', '鄂尔多斯市东胜区铜川镇铜川汽车博览园', '39.7872', '110.115', '内蒙古自治区', '鄂尔多斯市', '0477-5129922', '0 17000', '鄂尔多斯市新丰泰凯盛汽车有限责任公司', 1, 1, '', '');
dealerinfo[86] = new Array('CD1765', '山西显通', '山西省太原市平阳南路98号', '37.780921', '112.55444699999998', '山西省', '太原市', '0351-7032555', '0 30024', '山西显通汽车销售有限公司', 1, 1, 'http://sxxt.ecaddy.com.cn/', '/upload/dealer/qcode/20150515133212028_山西显通.jpg');
dealerinfo[87] = new Array('CD8660', '龙岩泰成致尊', '福建省龙岩市新罗区龙门物流大道311号1号店 ', '25.2222060000', '117.0863220000', '福建省', '龙岩市', '0597-2880888', '364015', '龙岩泰成致尊汽车服务有限责任公司', 2, 1, '', '');
dealerinfo[88] = new Array('CD8000', '上海永达申松', '上海市松江区松卫北路1110号荣乐东路口', '31.022267', '121.268181', '上海市', '上海市', '021-57706789', '201613', '上海永达申松汽车销售服务有限公司', 2, 1, '', '');
dealerinfo[89] = new Array('CD8001', '上海奉贤东昌凯帝', '上海市奉贤区奉浦大道518号海业大厦1楼', '30.947857', '121.458198', '上海市', '上海市', '021-67105880', '201400', '上海奉贤东昌凯帝汽车销售服务有限公司', 2, 1, '', '');
dealerinfo[90] = new Array('CD8400', '滨州市润华凯迪', '滨州市黄河二路468号', '37.3776170000', '117.9727930000', '山东省', '滨州市', '0543-2296666', '256600', '滨州市润华凯迪汽车销售服务有限公司', 2, 1, '', '');
dealerinfo[91] = new Array('CD8401', '威海鸿发凯迪', '山东省威海市经济区青岛南路219号', '37.403835', '122.166037', '山东省', '威海市', '0631-5970977', '264200', '威海鸿发凯迪汽车销售服务有限公司', 2, 1, '', '');
dealerinfo[92] = new Array('CD8403', '枣庄凯迪坤驰', '枣庄市市中区枣木高速转盘向南400米路东', '34.8705850000', '117.6060820000', '山东省', '枣庄市', '0632-5221888', '277000', '枣庄凯迪坤驰汽车销售服务有限公司', 2, 1, '', '');
dealerinfo[93] = new Array('CD8795', '六安世贸', '六安市皖西大市场A1栋', '31.75999', '116.573711', '安徽省', '六安市', '0564-3358111', '237000', '六安市世贸汽车销售服务有限公司', 2, 1, '', '');
dealerinfo[94] = new Array('CD8352', '丹阳东方朗通', '江苏丹阳市经济开发区黄金塘东路', '32.044081', '119.611274', '江苏省', '镇江市', '0511-86082333', '212300', '丹阳东方朗通汽车销售服务有限公司', 2, 1, '', '');
dealerinfo[95] = new Array('CD8825', '柳州桂海', '柳州市广汽路8号监测站3号门面及二楼办公室', '24.314276', '109.370477', '广西壮族自治区', '柳州市', '0772-8803385', '545005', '柳州桂海汽车销售服务有限公司', 2, 1, '', '');
dealerinfo[96] = new Array('CD8840', '上饶绿地', '江西省上饶市三清山西大道33号（沪昆高速桥洞北）', '28.462779', '117.908557', '江西省', '上饶市', '0793-8878088', '334000', '上饶市绿地名凯汽车销售服务有限公司', 2, 1, '', '');
dealerinfo[97] = new Array('CD8700', '郴州申湘天衡', '郴州市开发区南岭大道旁98号（郴州申湘汽车集团）', '25.756218', '113.003707', '湖南省', '郴州市', '0735-8880167', '423000', '郴州申湘天衡汽车销售服务有限公司', 2, 1, '', '');
dealerinfo[98] = new Array('CD8701', '湖南申湘常德天衡', '湖南省常德市武陵区东郊乡皇木关居委会（沅水二桥附近）', '29.002072', '111.721752', '湖南省', '常德市', '0736-7725688', '415000', '湖南申湘汽车常德天衡有限公司', 2, 1, '', '');
dealerinfo[99] = new Array('CD8201', '深圳红彤龙辉', '广东省深圳市罗湖区红岭北路3002号', '22.5740810000', '114.1128860000', '广东省', '深圳市', '0755-89332233', '518000', '深圳市红彤龙辉凯迪汽车销售服务有限公司', 2, 1, '', '');
dealerinfo[100] = new Array('CD8200', '佛山恒凯', '佛山市禅城区佛山大道中38号佛山车城首层', '23.007524', '113.109947', '广东省', '佛山市', '0757-83938422', '528000', '佛山市恒凯汽车销售有限公司', 2, 1, '', '');
dealerinfo[101] = new Array('CD8855', '遵义通远', '贵州省遵义市红花岗区海尔大道碧海馨苑5-7号', '27.658918', '106.906242', '贵州省', '遵义市', '0851-28607111', '563000', '遵义通远汽车销售服务有限公司', 2, 1, '', '');
dealerinfo[102] = new Array('CD8676', '乐山新东信', '四川省乐山市市中区长青路803号（原长药厂斜对面城际领域）', '29.59485', '103.725522', '四川省', '乐山市', '0833-2490111', '614000', '乐山新东信汽车有限公司', 2, 1, '', '');
dealerinfo[103] = new Array('CD8675', '德阳海之怡', '四川省德阳市旌阳区泰山南路二段280号', '31.11303', '104.397216', '四川省', '德阳市', '0838-2305566', '618000', '德阳海之怡汽车有限公司', 2, 1, '', '');
dealerinfo[104] = new Array('CD8677', '西昌美威行', '四川省凉山州西昌市安宁镇机场路(中国十九冶金钢构对面)', '27.955313', '102.205974', '四川省', '凉山彝族自治州', '0834-2503089', '615000', '西昌市美威行汽车销售有限公司', 2, 1, '', '');
dealerinfo[105] = new Array('CD8679', '宜宾美威行', '四川省宜宾市翠屏区翠柏大道（春江盛景A区天桥旁）', '28.747575', '104.600311', '四川省', '宜宾市', '0831-8168111', '644000', '宜宾美威行汽车销售有限公司', 2, 1, '', '');
dealerinfo[106] = new Array('CD8678', '达州美威行', '四川省达州西外金龙大道达州电视大学对面', '31.213665', '107.471025', '四川省', '达州市', ' 0818-2257571', '635000', '达州市美威行汽车销售有限公司', 2, 1, '', '');
dealerinfo[107] = new Array('CD8693', '襄阳恒信星凯', '襄阳市襄州区钻石大道深圳工业园恒信国际名车城', '32.125718', '112.27493', '湖北省', '襄阳市', '0710-2693333', '441000', '襄阳恒信星凯汽车销售服务有限公司', 2, 1, '', '');
dealerinfo[108] = new Array('CD8692', '黄石恒信星凯', '黄石市团成山开发区大泉路149号', '30.213166', '115.016269', '湖北省', '黄石市', '0714-6399995', '435000', '黄石恒信星凯汽车销售服务有限公司', 2, 1, '', '');
dealerinfo[109] = new Array('CD8691', '荆州恒信星凯', '荆州市荆州区荆沙大道马河渔场凯迪拉克专营店', '30.361671', '112.227811', '湖北省', '荆州市', '0716-8491555', '434000', '荆州市恒信星凯汽车销售服务有限公司', 2, 1, '', '');
dealerinfo[110] = new Array('CD8051', '许昌威佳金凯', '许昌市许由路与仓库路交叉口向南300米路西', '34.005698', '113.839313', '河南省', '许昌市', '0374-8095555', '461000', '许昌威佳金凯汽车销售服务有限公司', 2, 1, '', '');
dealerinfo[111] = new Array('CD8053', '焦作威佳金凯', '焦作市丰收路与孟州路交叉口西北角', '35.211415', '113.236295', '河南省', '焦作市', '0391-3690777', '454150', '焦作威佳金凯汽车销售有限公司', 2, 1, '', '');
dealerinfo[112] = new Array('CD8052', '安阳卡迪', '安阳市开发区光明路', '36.061561', '114.416895', '河南省', '安阳市', '0372-2117999', '455000', '安阳市卡迪汽车贸易有限公司', 2, 1, '', '');
dealerinfo[113] = new Array('CD8940', '青海赛亚金晟', '青海省西宁经济技术开发区昆仑东路22号', '36.569169', '101.877025', '青海省', '西宁市', '0971-8820388', '810006', '青海赛亚金晟汽车有限公司', 1, 1, '', '');
dealerinfo[114] = new Array('CD8100', '北京达世行亦凯', '北京市通州区光机电一体化产业基地渠羊路嘉创一街20号', '39.820213', '116.559342', '北京市', '北京市', '010-80821700', '101111', '北京达世行亦凯汽车销售服务有限公司', 2, 1, 'http://bjdshyk.ecaddy.com.cn/', '/upload/dealer/qcode/20150515132948283_北京达世行亦凯.jpg');
dealerinfo[115] = new Array('CD1305', '江阴全顺凯迪', '江阴市澄场路汽车城（新车管所对面）', '31.88566667', '120.3071667', '江苏省', '无锡市', '0510-81617788', '214400', '江阴市凯迪汽车销售服务有限公司', 1, 1, 'http://jykd.ecaddy.com.cn/', '/upload/dealer/qcode/20150602123709698_江阴凯迪.png');
dealerinfo[116] = new Array('CD1678', '泸州凯孚', '四川省泸州市龙马潭区鱼塘经济开发区振兴路建国汽车产业园', '28.936944', '105.48434', '四川省', '泸州市', '0830-2623000', '646000', '泸州凯孚汽车销售服务有限公司', 1, 1, 'http://lzkf.ecaddy.com.cn/', '/upload/dealer/qcode/20150814112715551_泸州凯孚.jpg');
dealerinfo[117] = new Array('CD1814', '云南新东信', '云南省昆明市经开区顺通大道国际汽车城D05', '24.975502', '102.801205', '云南省', '昆明市', '0871-68018811', '650217', '云南新东信汽车服务有限公司', 1, 1, 'http://ynxdx.ecaddy.com.cn/', '/upload/dealer/qcode/20150515132753587_云南新东信.jpg');
dealerinfo[118] = new Array('CD1416', '济宁朗巍', '山东省济宁市高新区新327国道杨家河公园对面圣达汽车城', '35.456943', '116.701827', '山东省', '济宁市', '0537-5152555', '', '山东朗巍凯迪汽车销售服务有限公司', 1, 1, 'http://sdlw.ecaddy.com.cn/', '/upload/dealer/qcode/20150515130918848_山东朗巍.jpg');
dealerinfo[119] = new Array('CD1511', '台州卡迪', '浙江省台州市路桥区迎宾大道方林村（靠近路泽太一级公路）', '28.556327', '121.405277', '浙江省', '台州市', '0576-80282818', '318050', '台州卡迪汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[120] = new Array('CD1661', '福建中凯', '福建省福州市闽侯县青口海峡汽车城凯迪拉克展厅', '25.901125', '119.384685', '福建省', '福州市', '0591-22252577', '350001', '福建中凯汽车销售有限公司', 1, 1, 'http://fjzk.ecaddy.com.cn/', '/upload/dealer/qcode/20150515125719658_福建中凯.jpg');
dealerinfo[121] = new Array('CD8915', '嘉峪关赛亚金茂', '嘉峪关市嘉东工业园区金港路西侧', '39.7702680000', '98.3509800000', '甘肃省', '嘉峪关市', '0937-6377700', '', '嘉峪关赛亚金茂汽车有限公司', 2, 1, '', '');
dealerinfo[122] = new Array('CD8670', '阿克苏骏腾', '新疆阿克苏市温宿县阿温大道大欣国际汽车城内', '41.227049', '80.253618', '新疆维吾尔自治区', '阿克苏地区', '0997-4029888', '', '阿克苏骏腾汽车销售服务有限公司', 2, 1, '', '');
dealerinfo[123] = new Array('CD1302', '连云港润合', '江苏省连云港新浦开发区岗埠农场八中队向西六公里', '34.58566667', '119.0565', '江苏省', '连云港市', '0518-80682999', '', '连云港润合汽车销售有限公司', 1, 1, 'http://lygrh.ecaddy.com.cn/', '/upload/dealer/qcode/20151014141327428_连云港润合.jpg');
dealerinfo[124] = new Array('CD1303', '南通长江', '江苏省南通市开发区星湖大道1002号（沈海高速竹行出口处）', '31.91944444', '120.9863889', '江苏省', '南通市', '0513-89191699', '', '南通长江汽车投资有限公司', 1, 1, 'http://ntcj.ecaddy.com.cn/', '/upload/dealer/qcode/20150515130557954_南通长江.jpg');
dealerinfo[125] = new Array('CD1223', '东莞正通', '东莞市常平镇环常西路桥梓路段额头工业区1号', '22.97183333', '113.9558333', '广东省', '东莞市', '0769-82656113', '', '东莞正通凯迪汽车销售服务有限公司', 1, 1, 'http://dwztkd.ecaddy.com.cn/', '/upload/dealer/qcode/20150603155725397_东莞正通凯迪.png');
dealerinfo[126] = new Array('CD1207', '广州南菱凯迪', '广州市白云区白云大道1399号', '23.234373', '113.309447', '广东省', '广州市', '020-23325088', '510440', '广州市南菱凯迪汽车有限公司', 1, 1, 'http://gznlkd.ecaddy.com.cn/', '/upload/dealer/qcode/20150515131346284_广州市南菱凯迪.jpg');
dealerinfo[127] = new Array('CD1417', '泰安丰迪', '泰安市泰山区明堂路中段', '36.237743', '117.198501', '山东省', '泰安市', '0538-5362222', '271000', '泰安丰迪汽车销售服务有限公司', 1, 1, 'http://tafd.ecaddy.com.cn/', '/upload/dealer/qcode/20151225165023084_泰安丰迪汽车销售服务有限公司.jpg');
dealerinfo[128] = new Array('CD8826', '桂林桂海', '桂林市临桂新区临桂镇秧塘工业园西城西路', '25.226083', '110.17579', '广西壮族自治区', '桂林市', '0773-3568188', '541000', '桂林桂海汽车销售服务有限责任公司', 2, 1, '', '');
dealerinfo[129] = new Array('CD1691', '宜昌恒信星凯', '宜昌市发展大道38号', '30.718429', '111.331202', '湖北省', '宜昌市', '0717-6858111', '443000', '宜昌恒信星凯汽车销售服务有限公司', 1, 1, 'http://ychxxk.ecaddy.com.cn/', '/upload/dealer/qcode/20150814112617083_宜昌恒信星凯.jpg');
dealerinfo[130] = new Array('CD2675', '成都凯迪', '四川省成都市武侯区武兴一路17号', '30.640369', '103.997464', '四川省', '成都市', '028-85020666', '610045', '成都凯迪汽车销售服务有限公司', 1, 1, 'http://cdkd.ecaddy.com.cn/', '/upload/dealer/qcode/20150515132404881_成都凯迪.jpg');
dealerinfo[131] = new Array('CD8662', '福州中凯卡迪', '福州市鼓楼区北环西路392号左海科技大厦A区综合一层12#店面', '26.108702', '119.291202', '福建省', '福州市', '0591-87725177', '350003', '福州中凯卡迪汽车服务有限公司', 2, 1, '', '');
dealerinfo[132] = new Array('CD1025', '上海安吉名轩', '上海市杨浦区双阳北路490号', '31.306311', '121.530043', '上海市', '上海市', '021-60953393', '200433', '上海安吉名轩汽车销售服务有限公司', 1, 1, 'http://shajmx.ecaddy.com.cn/', '/upload/dealer/qcode/20150814112011400_上海安吉名轩.jpg');
dealerinfo[133] = new Array('CD1512', '上汽名杰', '浙江省温州市瓯海区瓯海大道388号（车立方园内）', '27.966401', '120.671053', '浙江省', '温州市', '0577-55591888', '325000', '温州上汽名杰汽车销售服务有限公司', 1, 1, 'http://wzsqmj.ecaddy.com.cn/', 'http://mini.cadillac.com.cn/upload/dealer/qcode/20160603152655850_温州上汽名杰汽车销售服务有限公司.jpg');
dealerinfo[134] = new Array('CD1354', '淮安益都', '淮安市淮阴区香港路558号', '33.644288', '119.027452', '江苏省', '淮安市', '0517-80558888', '223300', '淮安益都汽车销售服务有限公司', 1, 1, 'http://hayd.ecaddy.com.cn/', '/upload/dealer/qcode/20150814112153601_淮安益都.jpg');
dealerinfo[135] = new Array('CD1842', '永达荣建', '江西省赣州市经济技术开发区金岭西路156号', '25.844185', '114.874011', '江西省', '赣州市', '0797-8087888', '341000', '江西永达荣建汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[136] = new Array('CD1208', '佛山时利和', '佛山巿南海区桂城街道海八路61号街区西北角', '23.073462', '113.165409', '广东省', '佛山市', '0757-66869999', '528200', '佛山时利和凯迪汽车销售服务有限公司', 1, 1, 'http://fsslhkd.ecaddy.com.cn/', '/upload/dealer/qcode/20150515131252294_佛山时利和.jpg');
dealerinfo[137] = new Array('CD1306', '宿迁东方谊通', '江苏省宿迁市双庄汽车产业园苏驰路66号', '33.95205', '118.296893', '江苏省', '宿迁市', '0527-82868555', '223800', '宿迁东方谊通汽车销售服务有限公司', 1, 1, 'http://sqdfyt.ecaddy.com.cn/', '/upload/dealer/qcode/20151014141646006_宿迁东方谊通.jpg');
dealerinfo[138] = new Array('CD1688', '武汉恒信星凯', '湖北省武汉市洪山区珞狮南路野芷湖大桥下（华中农业大学西门）', '30.480105', '114.357036', '湖北省', '武汉市', '027-87396888           ', '430000', '武汉恒信星凯汽车销售服务有限公司', 1, 1, 'http://hxxk.ecaddy.com.cn/', '/upload/dealer/qcode/20150515132711277_恒信星凯.jpg');
dealerinfo[139] = new Array('CD1750', '哈尔滨康顺俊凯', '哈尔滨市道里区机场路161号（国际汽车城园区内）', '45.702388', '126.54561', '黑龙江省', '哈尔滨市', '0451-84230202', '150007', '哈尔滨康顺俊凯汽车销售服务有限公司', 1, 1, 'http://hebksjk.ecaddy.com.cn/', '/upload/dealer/qcode/20150515133151245_哈尔滨康顺俊凯.jpg');
dealerinfo[140] = new Array('CD1102', '北京康顺凯迪', '北京市丰台区南四环中路辅路临140号', '39.836504', '116.378657', '北京市', '北京市', '010-59271111', '100076', '北京康顺凯迪汽车销售服务有限公司', 1, 1, 'http://bjkskd.ecaddy.com.cn/', '/upload/dealer/qcode/20150515133038745_北京康顺凯迪.jpg');
dealerinfo[141] = new Array('CD1856', '贵州广物盈凯', '贵州省贵阳市清镇市3号街红枫汽车文化广场 ', '26.638174', '106.513993', '贵州省', '贵阳市', '0851-82576888', '551400', '贵州广物盈凯汽车销售服务有限公司', 1, 1, 'http://gzgwyk.ecaddy.com.cn/', '/upload/dealer/qcode/20150603155808546_贵州广物盈凯.png');
dealerinfo[142] = new Array('CD1586', '元通凯迪', '浙江省衢州市衢江区东迹大道918号', '28.95691', '118.875842', '浙江省', '衢州市', '0570-2288666', '324000', '衢州元通凯迪汽车有限公司', 1, 1, '', '');
dealerinfo[143] = new Array('CD1813', '大理悦凯', '云南省大理市凤仪镇千户营村丰赢汽车城', '25.6139600000', '100.3101950000', '云南省', '大理市', '0874-3567010', '655000', '大理英茂悦凯汽车贸易服务有限公司', 1, 1, '', '');
dealerinfo[144] = new Array('CD1211', '江门凯泰', '广东省江门市新会区冈州大道东45号1座', ' 22.539548', '113.064706', '广东省', '江门市', '0750-6307888', '529100', '江门凯泰汽车销售服务有限公司', 1, 1, 'http://jmkt.ecaddy.com.cn/', '/upload/dealer/qcode/20150515132039487_江门凯泰.jpg');
dealerinfo[145] = new Array('CD1403', '烟台鸿发', '山东省烟台市福山区东陌堂村北机场路西侧', '37.420031', '121.362425', '山东省', '烟台市', '0535-2158111', '265500', '烟台鸿发凯迪汽车销售服务有限公司', 1, 1, 'http://ythf.ecaddy.com.cn/', '/upload/dealer/qcode/20150515131217584_烟台鸿发.jpg');
dealerinfo[146] = new Array('CD1707', '衡阳沪豪', '湖南省衡阳市石鼓区蒸湘北路333号（朝阳加气站对面）', '26.942077', '112.629718', '湖南省', '衡阳市', '0734-2833777', '421001', '衡阳沪豪汽车销售服务有限公司', 1, 1, 'http://hyhh.ecaddy.com.cn/', '/upload/dealer/qcode/20150515131940619_衡阳沪豪.jpg');
dealerinfo[147] = new Array('CD2676', '南充新东信', '四川省南充市顺庆区潆溪川东北汽贸中心', '30.882448', '106.07273', '四川省', '南充市', '0817-2815555', '637000', '南充新东信汽车服务有限公司', 1, 1, '', '');
dealerinfo[148] = new Array('CD1318', '宜兴天汇', '宜兴市经济开发区赛特大道国际汽车城（高路口）', '31.437205', '119.900074', '江苏省', '宜兴市', '0510-80786958', '214200', '宜兴市天汇汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[149] = new Array('CD1313', '常州凯帝', '江苏省常州市武进横山桥镇汽车城', '31.794949', '120.103879', '江苏省', '常州市', '0519-88886880', '213000', '常州凯帝汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[150] = new Array('CD1662 ', '厦门建发凯迪拉克', '福建省厦门市集美区北站汽车物流园建发凯迪拉克', '24.489231', '118.103886', '福建省', '厦门市', '0592-3844888', '', '厦门建发凯迪汽车销售有限公司', 1, 1, 'http://xmjf.ecaddy.com.cn/', '/upload/dealer/qcode/20150602122943422_厦门建发.png');
dealerinfo[151] = new Array('CD1209', '湛江正通', '广东省湛江市赤坎区东盛路7号S13（海田国际汽车城内）', '21.257463', '110.365067', '广东省', '湛江市', '0759-3370111', '524001', '湛江正通凯迪汽车销售服务有限公司', 1, 1, 'http://zjzt.ecaddy.com.cn/', '/upload/dealer/qcode/20150515132243190_湛江正通.jpg');
dealerinfo[152] = new Array('CD1319', '昆山安吉名轩', '昆山市萧林东路翠薇西路（周市汽车城）', '31.410457', '121.025186', '江苏省', '昆山市', '0512-36872333', '215300', '昆山安吉名轩汽车销售服务有限公司', 1, 1, 'http://ksajmx.ecaddy.com.cn/', '/upload/dealer/qcode/20150515130513316_昆山安吉名轩.jpg');
dealerinfo[153] = new Array('CD1798', '阜阳亚夏凯迪拉克', '阜阳市开发区汽贸物流园汽贸路1号', '32.901211', '115.820932', '安徽省', '阜阳市', '0558-3597777', '236000', '阜阳亚夏凯迪拉克汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[154] = new Array('CD1720', '海南海之怡凯迪拉克', '海口市秀英区永万路116号（南海大道与永万路交界处）', '20.00031', '110.27243', '海南省', '海口市', '0898-66982666', '', '海南海之怡汽车销售服务有限公司', 1, 1, 'http://hnhzy.ecaddy.com.cn/', '/upload/dealer/qcode/20150515131914569_海南海之怡.jpg');
dealerinfo[155] = new Array('CD1001', '上海中致远凯迪', '上海市闵行区颛兴东路1280弄2号', '31.0809069694', '121.4249249141', '上海市', '上海市', '021-52968888', '201108', '上海中致远凯迪汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[156] = new Array('CD1315', '南京安吉名杰', '南京市红山路90号', '32.088317', '118.80948899999999', '江苏省', '南京市', '025-86673333', '210028', '南京安吉名杰汽车销售服务有限公司', 1, 1, 'http://njajmj.ecaddy.com.cn/', '/upload/dealer/qcode/20150602123609453_南京安吉名杰.png');
dealerinfo[157] = new Array('CD1659', '洛阳威佳盛凯', '河南省洛阳市高新区河洛路与安康路交叉口（安康路北段）', '34.6065320000', '112.3457520000', '河南省', '洛阳市', '0379-65101111', '471000', '洛阳威佳盛凯汽车销售服务有限公司', 1, 1, 'http://lywjks.ecaddy.com.cn/', '/upload/dealer/qcode/20160328141626164_洛阳威佳盛凯汽车销售服务有限公司.jpg');
dealerinfo[158] = new Array('CD8405', '菏泽凯迪坤驰', '山东省菏泽市开发区黄河东路88号', '35.2720500000', '115.5747210000', '山东省', '菏泽市', '0530-5022777', '', '菏泽凯迪坤驰汽车销售服务有限公司', 1, 1, 'http://hzkdkc.ecaddy.com.cn/', '/upload/dealer/qcode/20150814112224707_菏泽凯迪坤驰.jpg');
dealerinfo[159] = new Array('CD8055', '商丘凯迪 ', '商丘市梁园区民主路与金桥路交叉口', '34.44585', '115.6024330000', '河南省', '商丘市', '0370-8992888', '476000', '商丘凯迪拉克汽车贸易有限公司   ', 1, 1, '', '');
dealerinfo[160] = new Array('CD1618', '东昌凯迪', '天津市西青经济开发区大寺高新技术产业园储源道10号', '39.017321', '117.224191', '天津市', '天津市', '022-60120188', '300385', '天津东昌汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[161] = new Array('CD1321', '文洋太仓 ', '太仓市人民东路与宁波北路交界处 ', '31.571904', '121.158978 ', '江苏省', ' 太仓市', '0512-53776509', '215400', '太仓文洋申港汽车销售服务有限公司  ', 1, 1, '', '');
dealerinfo[162] = new Array('CD2765', '太原鑫晶通', '山西省太原市小店区太榆路101号', '37.7983280000', '112.6063690000', '山西省', '太原市', '0351-7788788', '030000', '太原鑫晶通汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[163] = new Array('CD1871', '乌鲁木齐汇京凯福专营店', '新疆乌鲁木齐市新市区乌昌路2094号', '43.8883860000', '87.5198480000', '新疆维吾尔自治区', '乌鲁木齐市', '0991-6368888', '830014', '乌鲁木齐汇京凯福汽车销售有限公司', 1, 1, '', '');
dealerinfo[164] = new Array('CD1665', '泉州建发', '福建省晋江市罗山街道缺塘社区汽车市场二期B区', '24.7894020000', '118.5756910000', '福建省', '晋江市', '0595-82555789', '362000', '泉州惠通嘉华汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[165] = new Array('CD1316', '华成吴江凯迪拉克', '苏州市吴江区吴江经济技术开发区行家路358号', '31.0148470000', '120.6394020000', '江苏省', '苏州市', '0512-63808858', '215000', '苏州华成吴江汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[166] = new Array('CD1782', '榆林凯瑞', '陕西省榆林市榆阳区麻黄梁汽车产业园', '38.338919', '109.870186', '陕西省', '榆林市', '0912-2374888', '719000', '榆林凯瑞汽车销售有限公司', 1, 1, '', '');
dealerinfo[167] = new Array('CD1767', '吉林永通弘远', '吉林市昌邑区珲春北街2号', '43.8851920000', '126.5313370000', '吉林省', '吉林市', '0432-63133777', '132000', '吉林市永通弘远汽车销售有限责任公司', 1, 1, 'http://jlythy.ecaddy.com.cn/', '/upload/dealer/qcode/20150814112808028_吉林市永通弘远汽车销售有限责任公司.jpg');
dealerinfo[168] = new Array('CD1328', '南通恒仁行', '南通市通甲路588号（世伦路路口，新车管所西北侧）', '32.0167800000', '120.9265980000', '江苏省', '南通市', '0513-89150888', '226000', '南通恒仁行汽车销售服务有限公司', 1, 1, 'http://nthrh.ecaddy.com.cn/', '/upload/dealer/qcode/20151014141713541_南通恒仁行.jpg');
dealerinfo[169] = new Array('CD1708', '怀化凯成', '湖南省怀化市鹤城区南环路国际汽车城内', '27.5238960000', '110.0054330000', '湖南省', '怀化市', '0745-2398666', '418000', '怀化凯成汽车销售服务有限公司', 1, 1, 'http://hhkc.ecaddy.com.cn/', '/upload/dealer/qcode/20151014142055191_怀化凯成汽车销售服务有限公司.jpg');
dealerinfo[170] = new Array('CD1419', '德州汇通', '德州新河东路与长河大道交汇处南行200米路西（市委党校北临）', '37.4238320000', '116.3609500000', '山东省', '德州市', '0534-8779999', '', '德州汇通汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[171] = new Array('CD1418', '聊城凯迪', '聊城市光岳北路五洲汽车园内', '36.4856890000', '116.0312930000', '山东省', '聊城市', '0635-8253777', '252000', '聊城五洲凯迪汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[172] = new Array('CD1709', '株洲兰天凯天', '株洲市荷塘区红港路汽车城区内', '27.870037', '113.15972', '湖南省', '株洲市', '0731-28210567', '', '株洲兰天凯天汽车销售有限公司', 1, 1, 'http://zzltkt.ecaddy.com.cn/', '/upload/dealer/qcode/20150814112327476_株洲兰天凯天.jpg');
dealerinfo[173] = new Array('CD1587', '宁波永达', '浙江省宁波市鄞州区集士港秋实北路88号（奥特莱斯购物广场往北1公里处）', '29.8735160000', '121.4511720000', '浙江省', '宁波市', '0574-55846789', '315171', '宁波永达通凯汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[174] = new Array('CD1663', '福州凯迪', '福州市仓山区城门镇福峡路43号', '26.0028000000', '119.3659480000', '福建省', '福州市', '0591-87376789', '350000', '福州凯迪汽车服务有限公司', 1, 1, 'http://fzkd.ecaddy.com.cn/', '/upload/dealer/qcode/20150515125749380_福州凯迪.jpg');
dealerinfo[175] = new Array('CD1601', '重庆苏渝', '重庆市渝中区九滨路黄沙溪车站（环卫三所对面）', '29.5458560000', '106.5356890000', '重庆市', '重庆市', '023-68001999', '400000', '重庆苏渝爱众汽车销售服务有限公司', 1, 1, '', '');
dealerinfo[176] = new Array('CD1799', '亚夏凯迪拉克', '滁州市琅琊区永阳路9号（南洛高速入口旁）', '32.354359', '118.353336', '安徽省', '滁州市', '0550-3318000', '', '滁州亚夏凯迪拉克', 1, 1, '', '');
dealerinfo[177] = new Array('CD8404', '莱芜丰迪', '山东省莱芜市高新技术开发区白云山路18号', '36.206112', '117.735632', '山东省', '莱芜市', '0634-8556777', '271100', '莱芜丰迪汽车销售服务有限公司', 2, 1, '', '');
dealerinfo[178] = new Array('CD8056', '信阳威佳', '信阳市工业城老312国道与工十四路交叉口东500米', '32.198414', '115.666374', '河南省', '信阳市', '0376-3303555', '464100', '信阳威佳金凯汽车销售服务有限公司', 2, 1, '', '');
dealerinfo[179] = new Array('CD8856', '六盘水通远', '贵州省六盘水市德坞高架桥旁通源汽车', '26.608727', '104.821068', '贵州省', '六盘水市', '0858-8195123', '553000', '六盘水通远汽车销售服务有限公司', 2, 1, '', '');
dealerinfo[180] = new Array('CD8661', '厦门众驰', '厦门市湖里区枋湖东路8号（紧邻厦门车管所）', '24.518862', '118.159951', '福建省', '厦门市', '0592-3944888', '361000', '厦门众驰汽车有限公司', 2, 1, '', '');
dealerinfo[181] = new Array('CD1405', '运城凯泽', '山西省运城市黄河大道北段新车检中心对面', '35.0928240000', '110.9670320000', '山西省', '运城市', '0359-2379888', '044000', '运城市元通凯泽汽车销售服务有限公司', 1, 1, 'http://yckz.ecaddy.com.cn/', '/upload/dealer/qcode/20151225165053930_运城市元通凯泽汽车销售服务有限公司.jpg');
dealerinfo[182] = new Array('CD1602', '重庆协信美威行', '重庆市巴南区渝南分流道凯迪拉克4S店（近南坪八公里西部汽车城旁）', '29.4840730000', '106.5661840000', '重庆市', '重庆市', '', '401320', '重庆协信美威行汽车销售服务有限公司', 1, 1, 'http://cqxxmwh.ecaddy.com.cn/', 'http://mini.cadillac.com.cn/upload/dealer/qcode/20160603154612340_重庆协信美威行汽车销售服务有限公司.jpg');
dealerinfo[183] = new Array('CD1826', '南宁恒信星凯', '广西南宁市西乡塘罗文大道50号', '22.7647180000', '109.5560160000', '广西壮族自治区', '南宁市', '400-815-8563', '530000', '南宁恒信星凯汽车销售服务有限公司', 2, 1, 'http://nnhxxk.ecaddy.com.cn/', '/upload/dealer/qcode/20150814112355266_南宁恒信星凯.jpg');
dealerinfo[184] = new Array('CD1336', '徐州文峰', '江苏省徐州市云龙区商聚路凯迪拉克4S店', '34.1969850000', '117.2539350000', '江苏省', '徐州市', '0516-83996888', '221100', '徐州文峰伟杰汽车销售服务有限公司', 1, 1, 'http://xzwfwj.ecaddy.com.cn/', '/upload/dealer/qcode/20151014141933330_徐州文峰伟杰.jpg');
dealerinfo[185] = new Array('CD1783', '西安泛想凯迪', '西安市雁塔区西沣公路58号泛想车城内', '34.1919650000', '108.8951660000', '陕西省', '西安市', '029-62390000', '710065', '西安泛想凯迪汽车销售服务有限公司', 1, 1, 'http://xafxkd.ecaddy.com.cn/', 'http://mini.cadillac.com.cn/upload/dealer/qcode/20160603154528977_西安泛想凯迪汽车销售服务有限公司.jpg');
dealerinfo[186] = new Array('CD1903', '通辽万林', '通辽市科尔沁区民航路北段西侧', '43.6129410000', '122.2568690000', '内蒙古自治区', '通辽市', '0475-8507777', '28000', '通辽市万林实业有限责任公司', 1, 1, '', '');
dealerinfo[187] = new Array('CD1632', '业乔汇通', '沈阳市大东区望花中街138号', '41.87116 ', '123.485043', '辽宁省', '沈阳市', '024-66819999', '', ' 沈阳业乔汇通汽车销售服务有限公司', 1, 1, 'http://syyq.ecaddy.com.cn/', '/upload/dealer/qcode/20160226111228796_沈阳业乔汇通汽车销售服务有限公司.jpg');
dealerinfo[188] = new Array('CD1716', '长沙兰天', '湖南省长沙市岳麓大道西3599号河西汽车城（长张高速收费站南侧）', '28.2506120000', '112.7946320000', '湖南省', '长沙市', '0731-88331199', '410209', '湖南兰天君天汽车销售有限公司', 1, 1, '', '');
dealerinfo[189] = new Array('CD1215', '惠州安迪', '广东省惠州市惠城区惠城大道安骅汽车城内', '23.1697780000', '114.4212310000', '广东省', '惠州市', '0752-5319388', '516023', '惠州市安迪汽车服务有限公司', 1, 1, '', '');
dealerinfo[190] = new Array('CD1571', '绍兴冠松', '浙江省绍兴市柯桥区金柯桥大道3568号（冠松凯迪拉克）', '30.1497400000', '120.5257660000', '浙江省', '绍兴市', '0575-81103333', '', '浙江冠松越达汽车销售服务有限公司', 1, 1, 'http://zjgsyd.ecaddy.com.cn/', 'http://mini.cadillac.com.cn/upload/dealer/qcode/20160603154430735_浙江冠松越达汽车销售服务有限公司.jpg');
